def get_prompt(paragraph):
    return f"""
اقرأ الفقرة التالية من كتاب لشيخ الإسلام ابن تيمية، وتأكد من محتواها وضع عنوانا مناسبا لها ورقم حسب الأقسام الآتية:
•	كل فقرة ليست تفسيراً لآية ولا شرحاً لحديث ولا حكماُ حديثياً ولا اجماعاً ولا ترجيحاً ولا قاعدة ولا موقف شخصي ستأخذ الرقم 9 وهو الأكثر غالباً.
•	تفسير الآيات وما يتعلق بها سيأخذ الرقم 1
•	شروح الأحاديث وما يتعلق بها ستأخذ الرقم 2
•	الأحكام الحديثية (أي الأحاديث التي حكم عليها بالصحة أو الضعف أو غيره) وسيأخذ الرقم 3
•	الإجماع وسيأخذ الرقم 4
•	مسائل الخلاف وهو ما ذكر شيخ الإسلام أن فيه خلاف وسيأخذ الرقم 5
•	الترجيح وهو ما ذكر فيه الراجح في مسألة ما وسيأخذ الرقم 6
•	القواعد والضوابط والفروق والتقاسيم وستأخذ الرقم 7
•	المواقف الشخصية لشيخ الإسلام ابن تيمية وستأخذ الرقم 8

ستحدد نوع الفقرة من خلال تحديد أحد الأرقام أعلاه وستكون مهمتك هي إضافة عنوان للفقرة بالتنسيق الآتي </رقم/عنوان>/> حيث ستحدد الرقم حسب النوع أعلاه من 1 إلى 9 ومن ثم ستضيف عنواناً مناسباً للفقرة يوضح محتواها ويربطها بالنسق العام والفقرات السابقة.

سبب التصنيف (للتوثيق فقط):
بعد كتابة العناوين المطلوبة، أضف في سطر جديد عبارة توضح السبب الذي جعلك تصنّف هذه الفقرة تحت هذا القسم.  
ابدأ التبرير بـ: (سبب التصنيف:) ثم أكمل التوضيح.
❗مهم: لا تكتب هذا التبرير إذا لم تجد أي كشاف علمي في الفقرة.

الفقرة:


{paragraph}
"""
